<center><h1><strong><font color="blue">Studi Kasus Data Wrangling</font></strong></h1></center>

![taudata Analytics](https://github.com/taudataid/eLearning/raw/master/images/covers/cover_ui-n-taudata.jpg "taudata Analytics")

# Referensi:

1. Rattenbury, Tye, et al. Principles of data wrangling: Practical techniques for data preparation. " O'Reilly Media, Inc.", 2017.

2. McKinney, Wes. Python for data analysis: Data wrangling with Pandas, NumPy, and IPython. " O'Reilly Media, Inc.", 2012.

In [3]:
# Load Module
import warnings; warnings.simplefilter('ignore')
import pandas as pd, numpy as np

'Done'

'Done'

<center><h1><strong><font color="blue"> Combining and Merging Datasets </font></strong></h1></center>

![taudata Analytics](https://github.com/taudataid/eLearning/raw/master/images/join-in-Pandas-dataframe.png "taudata Analytics")

Ada 3 macam:
* pandas.merge connects rows in DataFrames based on one or more keys. This will be familiar to users of SQL or other relational databases, as it implements database join operations.
* pandas.concat concatenates or “stacks” together objects along an axis.
* The combine_first instance method enables splicing together overlapping data to fill in missing values in one object with values from another.

<center><h1><strong><font color="blue"> Database-Style DataFrame Joins (Merge/Join) </font></strong></h1></center>

<img alt="" src="images/"/>

In [4]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
     'data1': range(7)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [5]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
    'data2': range(3)})
df2

  key  data2
0   a      0
1   b      1
2   d      2

# many-to-one join

the data in df1 has multiple rows labeled a
and b, whereas df2 has only one row for each value in the key column. Calling merge
with these objects we obtain:

## Data Mana yang Hilang? Mengapa?

In [6]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

# Bagaimana jika nama kolom berbeda?

In [7]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
    'data1': range(7)})
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [8]:
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
    'data2': range(3)})

df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [9]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')[['lkey', 'data1', 'data2']]

  lkey  data1  data2
0    b      0      1
1    b      1      1
2    b      6      1
3    a      2      0
4    a      4      0
5    a      5      0

# Inner join

You may notice that the 'c' and 'd' values and associated data are missing from the
result. By default merge does an 'inner' join; the keys in the result are the intersec‐
tion, or the common set found in both tables.

<img alt="" src="GitHub\eLearning\images/join-in-Pandas-dataframe.png"/>

# Outer Join

Other possible options are 'left', 'right', and 'outer'. The outer join takes the union of the keys, combining the
effect of applying both left and right joins:

In [10]:
pd.merge(df1, df2, how='outer') # Perhatikan outputnya.

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

# Many-to-many merges 

* well-defined, though not necessarily intuitive, behavior
* Many-to-many joins form the Cartesian product of the rows.

In [11]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
     'data1': range(6)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [12]:
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
    'data2': range(5)})

df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [13]:
pd.merge(df1, df2, on='key', how='right')

   key  data1  data2
0    a    2.0      0
1    a    4.0      0
2    b    0.0      1
3    b    1.0      1
4    b    5.0      1
5    a    2.0      2
6    a    4.0      2
7    b    0.0      3
8    b    1.0      3
9    b    5.0      3
10   d    NaN      4

Since there were three
'b' rows in the left DataFrame and two in the right one, there are six 'b' rows in the
result. The join method only affects the distinct key values appearing in the result:

In [14]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

<center><h1><strong><font color="blue"> merge with multiple keys </font></strong></h1></center>

* When you’re joining columns-on-columns, the indexes on the
passed DataFrame objects are discarded.

In [15]:
df1 = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
    'key2': ['one', 'two', 'one'],
    'lval': [1, 2, 3]})
df1

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [16]:
df2 = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
     'key2': ['one', 'one', 'one', 'two'],
     'rval': [4, 5, 6, 7]})
df2

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [17]:
pd.merge(df1, df2, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

# overlapping column names

* While you can address the overlap manually (Rename nama kolom), merge has a suffixes option for specifying strings to append to overlapping names in the left and right DataFrame objects

In [18]:
pd.merge(df1, df2, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [19]:
pd.merge(df1, df2, on='key1', suffixes=('_atu', '_dua'))

  key1 key2_atu  lval key2_dua  rval
0  foo      one     1      one     4
1  foo      one     1      one     5
2  foo      two     2      one     4
3  foo      two     2      one     5
4  bar      one     3      one     6
5  bar      one     3      two     7

<center><h1><strong><font color="blue"> Merging on Index </font></strong></h1></center>

In [20]:
df1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
    'value': range(6)})
df1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [21]:
df2 = pd.DataFrame({'group_val': [35, 7]}, index=['a', 'b'])
df2

   group_val
a         35
b          7

In [22]:
pd.merge(df1, df2, left_on='key', right_index=True)

  key  value  group_val
0   a      0         35
2   a      2         35
3   a      3         35
1   b      1          7
4   b      4          7

# Concatenating Along an Axis

In [27]:
# Concat di DataFrame

df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
    columns=['one', 'two'])
df1

   one  two
a    0    1
b    2    3
c    4    5

In [28]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],
    columns=['three', 'four'])
df2

   three  four
a      5     6
c      7     8

In [29]:
pd.concat([df1, df2], axis=1) # , keys=['level1', 'level2']
#Perhatikan indexnya

   one  two  three  four
a    0    1    5.0   6.0
b    2    3    NaN   NaN
c    4    5    7.0   8.0

<center><h1><strong><font color="blue"> Data Aggregation and Group Operations </font></strong></h1></center>

![taudata Analytics](https://github.com/taudataid/eLearning/raw/master/images/Aggregrate-Groups-Pandas-dataframe.png "taudata Analytics")

* pandas provides a flexible groupby interface, enabling you to slice, dice, and summarize datasets in a natural way.
* Aggregation of time series data, a special use case of groupby, is referred to as resampling.

<center><h1><strong><font color="blue"> 1. GroupBy Mechanics </font></strong></h1></center>

![taudata Analytics](https://github.com/taudataid/eLearning/raw/master/images/Split-Apply-Combine-Pandas-dataframe.png "taudata Analytics")

* Hadley Wickham, an author of many popular packages for the R programming lan‐
guage, coined the term split-apply-combine for describing group operations.

In [30]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
    'key2' : ['one', 'two', 'one', 'two', 'one'],
    'data1' : np.random.randn(5),
    'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.552330 -0.948405
1    a  two -0.468837 -0.885058
2    b  one  0.984589 -0.975379
3    b  two -0.143028 -0.733251
4    a  one  2.381363 -1.756437

In [31]:
grouped = df.groupby(df['key1']).sum()
grouped

         data1    data2
key1
a     1.360196 -3.58990
b     0.841560 -1.70863

In [32]:
grouped.mean()

data1    1.100878
data2   -2.649265
dtype: float64

In [33]:
means = df.groupby([df['key1'], df['key2']]).mean()
means

              data1     data2
key1 key2
a    one   0.914516 -1.352421
     two  -0.468837 -0.885058
b    one   0.984589 -0.975379
     two  -0.143028 -0.733251

# Menghasilkan Hierarchical Index

In [34]:
means.unstack()

         data1               data2
key2       one       two       one       two
key1
a     0.914516 -0.468837 -1.352421 -0.885058
b     0.984589 -0.143028 -0.975379 -0.733251

In [35]:
df

  key1 key2     data1     data2
0    a  one -0.552330 -0.948405
1    a  two -0.468837 -0.885058
2    b  one  0.984589 -0.975379
3    b  two -0.143028 -0.733251
4    a  one  2.381363 -1.756437

In [36]:
df.groupby('key1').mean()

# You may have noticed in the first case df.groupby('key1').mean() that there is no key2 column in the result. 
# Because df['key2'] is not numeric data, it is said to be a nuisance column, which is therefore excluded from the result.

         data1     data2
key1
a     0.453399 -1.196633
b     0.420780 -0.854315

# GroupBy bisa flexible dengan memilih grouping berdasarkan kolom mana saja

* Sekalian rename hasil groupBy-nya

In [38]:
people = pd.DataFrame(np.random.randn(5, 5),
    columns=['a', 'b', 'c', 'd', 'e'],
    index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people

               a         b         c         d         e
Joe     0.155306  0.354546  0.238270 -0.539651 -0.109213
Steve  -0.877839  0.330998  0.276951  0.756581  0.471077
Wes     0.990097 -1.583719  0.369758  0.451516  1.493106
Jim     1.784809 -1.496550 -0.085447 -0.602219  0.330557
Travis  1.535067  0.919781  1.279579 -1.001464 -0.683880

In [39]:
d = {'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f' : 'orange'}
d

{'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

In [40]:
people.groupby(d, axis=1).sum()

            blue       red
Joe    -0.301381  0.400639
Steve   1.033532 -0.075764
Wes     0.821274  0.899483
Jim    -0.687666  0.618816
Travis  0.278115  1.770968

<center><h1><strong><font color="blue"> Data Aggregation </font></strong></h1></center>

<img alt="" src="GitHub\eLearning\images/GroupBy-Pandas-dataframe.png"/>

* Aggregations refer to any data transformation that produces scalar values from
arrays. 
* Tidak hanya fungsi yang ditabel diatas

In [41]:
df

  key1 key2     data1     data2
0    a  one -0.552330 -0.948405
1    a  two -0.468837 -0.885058
2    b  one  0.984589 -0.975379
3    b  two -0.143028 -0.733251
4    a  one  2.381363 -1.756437

In [42]:
df.groupby('key1').quantile(0.9)

         data1     data2
key1
a     1.811323 -0.897727
b     0.871827 -0.757463

# Custom Aggregate Function 

### Perhatikan, ini sangat penting untuk diketahui

In [43]:
def RangeData(arr):
    return arr.max() - arr.min()

In [44]:
df.groupby('key1').agg(RangeData)

         data1     data2
key1
a     2.933693  0.871379
b     1.127617  0.242128

# Apply di Dataframe

* Sangat penting juga untuk mengefisienkan Code

In [45]:
def sum_kuadrat(x):
    return x.sum()**2

data = {
  "x": [5, 4, 3],
  "y": [2, 1, 7]
}
df = pd.DataFrame(data)
df

   x  y
0  5  2
1  4  1
2  3  7

In [46]:
df.apply(sum_kuadrat)

x    144
y    100
dtype: int64

<center><h1><strong><font color="blue"> Pivot Tables and Cross-Tabulation </font></strong></h1></center>

A pivot table is a data summarization tool frequently found in spreadsheet programs
and other data analysis software. It aggregates a table of data by one or more keys,
arranging the data in a rectangle with some of the group keys along the rows and
some along the columns. Pivot tables in Python with pandas are made possible
through the groupby

In [47]:
import seaborn as sns

tips = sns.load_dataset("tips")
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [48]:
tips.pivot_table(index=['day', 'smoker'])

                 size       tip  total_bill
day  smoker
Thur Yes     2.352941  3.030000   19.190588
     No      2.488889  2.673778   17.113111
Fri  Yes     2.066667  2.714000   16.813333
     No      2.250000  2.812500   18.420000
Sat  Yes     2.476190  2.875476   21.276667
     No      2.555556  3.102889   19.661778
Sun  Yes     2.578947  3.516842   24.120000
     No      2.929825  3.167895   20.506667

# CrossTab

* A cross-tabulation (or crosstab for short) is a special case of a pivot table that computes group frequencies.

In [49]:
pd.crosstab(tips.day, tips.smoker)

smoker  Yes  No
day
Thur     17  45
Fri      15   4
Sat      42  45
Sun      19  57

# Kembali ke Case Study: Analisis Data Akademik

In [57]:
try: # Running Locally, yakinkan "file_" berada di folder "data"
    mengajar = pd.read_csv('data/mengajar.csv', encoding='utf8')
    dosen = pd.read_csv('data/tb_dosen.csv', encoding='utf8')
    kelas = pd.read_csv('data/tb_kelas.csv', encoding='utf8')
    krs = pd.read_csv('data/tb_krs.csv', encoding='utf8')
    mahasiswa = pd.read_csv('data/tb_mahasiswa.csv', encoding='utf8')
    matkul = pd.read_csv('data/tb_mata_kuliah.csv', encoding='utf8')
    nilai = pd.read_csv('data/tb_nilai.csv', encoding='utf8')
except: # Running in Google Colab
    !mkdir data
    !wget -P data/ https://raw.githubusercontent.com/taudataid/eLearning/master/data/tb_nilai.csv
    !wget -P data/ https://raw.githubusercontent.com/taudataid/eLearning/master/data/mengajar.csv
    !wget -P data/ https://raw.githubusercontent.com/taudataid/eLearning/master/data/tb_dosen.csv
    !wget -P data/ https://raw.githubusercontent.com/taudataid/eLearning/master/data/tb_kelas.csv
    !wget -P data/ https://raw.githubusercontent.com/taudataid/eLearning/master/data/tb_krs.csv
    !wget -P data/ https://raw.githubusercontent.com/taudataid/eLearning/master/data/tb_mahasiswa.csv
    !wget -P data/ https://raw.githubusercontent.com/taudataid/eLearning/master/data/tb_mata_kuliah.csv
    mengajar = pd.read_csv('data/mengajar.csv', encoding='utf8')
    dosen = pd.read_csv('data/tb_dosen.csv', encoding='utf8')
    kelas = pd.read_csv('data/tb_kelas.csv', encoding='utf8')
    krs = pd.read_csv('data/tb_krs.csv', encoding='utf8')
    mahasiswa = pd.read_csv('data/tb_mahasiswa.csv', encoding='utf8')
    matkul = pd.read_csv('data/tb_mata_kuliah.csv', encoding='utf8')
    nilai = pd.read_csv('data/tb_nilai.csv', encoding='utf8')

mengajar.shape, dosen.shape, kelas.shape, krs.shape, mahasiswa.shape, matkul.shape, nilai.shape

((14, 4), (4, 6), (4, 4), (7, 6), (15, 8), (9, 3), (33, 7))

In [59]:
mengajar.head()

   NIDN kode_MK Semester  Tahun
0   123   KAL01   ganjil   2020
1   123   KAL01   ganjil   2019
2   123   STA01    genap   2020
3   123   MAT01    genap   2020
4   123   STA02   ganjil   2019

![taudata Analytics](https://github.com/taudataid/eLearning/raw/master/images/Schema-case-study-02-Data-wrangling-academics-analytics.jpeg "taudata Analytics")

# Task 01:

## *Apakah ada dosen yang cenderung memberikan nilai cenderung lebih tinggi (atau lebih rendah) dibandingkan dosen lainnya?*

In [ ]:
# Code Untuk Task 01

# Diskusi 01: 

*

# Task 02:

## *Menurut data yang ada, apakah terdapat perbedaan dalam pemberian nilai antara dosen dengan Pendidikan Terakhir S3 dan S2?*

In [52]:
# Code Untuk Task 02

# Diskusi 02:

*

# Task 03:

## *Apakah terdapat perbedaan performa akademik antara mahasiswa yang berasal dari Madrasah/SMK dan SMU?*

In [53]:
# Code Task 03

# Diskusi 03:

*

# Task 04:

## *Apakah ada perbedaan yang nampak di data terhadap kemampuan akademik antara mahasiswa dan mahasiswi?*

In [54]:
# Code Task 04

# Diskusi 04

*

# Task 05:

## *Apakah ada perbedaan prestasi akademik yang nampak di data antar angkatan mahasiswa?*

In [55]:
# Code Task 05

# Diskusi 05

*

# Task 06:

## *Apakah ada permasalahan di data atau informasi lain yang anda temukan di data?*

In [56]:
# Code Task 06

# Diskusi 06

*